## Staging: sqs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                     |
|----------|----------------------------------------------|
| recreate | `aws_sqs_queue.reliability_deadletter_queue` |
|          | `aws_sqs_queue.reliability_queue`            |
|          | `aws_sqs_queue.reprocess_submission_queue`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sqs_queue.reliability_deadletter_queue must be replaced
-/+ resource "aws_sqs_queue" "reliability_deadletter_queue" {
      ~ arn                               = "arn:aws:sqs:ca-central-1:687401027353:reliability_deadletter_queue.fifo" -> (known after apply)
      ~ content_based_deduplication       = true -> false
      ~ deduplication_scope               = "queue" -> (known after apply)
      ~ fifo_queue                        = true -> false # forces replacement
      ~ fifo_throughput_limit             = "perQueue" -> (known after apply)
      ~ id                                = "https://sqs.ca-central-1.amazonaws.com/687401027353/reliability_deadletter_queue.fifo" -> (known after apply)
      ~ name                              = "reliability_deadletter_queue.fifo" -> "reliability_deadletter_queue" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      ~ sqs_managed_sse_enabled           = false -> (known after apply)
      - tags                              = {} -> null
      ~ url                               = "https://sqs.ca-central-1.amazonaws.com/687401027353/reliability_deadletter_queue.fifo" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_sqs_queue.reliability_queue must be replaced
-/+ resource "aws_sqs_queue" "reliability_queue" {
      ~ arn                               = "arn:aws:sqs:ca-central-1:687401027353:submission_processing.fifo" -> (known after apply)
      ~ content_based_deduplication       = true -> false
      ~ deduplication_scope               = "queue" -> (known after apply)
      ~ fifo_queue                        = true -> false # forces replacement
      ~ fifo_throughput_limit             = "perQueue" -> (known after apply)
      ~ id                                = "https://sqs.ca-central-1.amazonaws.com/687401027353/submission_processing.fifo" -> (known after apply)
      ~ name                              = "submission_processing.fifo" -> "reliability_queue" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      ~ redrive_policy                    = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:ca-central-1:687401027353:reliability_deadletter_queue.fifo"
              - maxReceiveCount     = 5
            }
        ) -> (known after apply)
      ~ sqs_managed_sse_enabled           = false -> (known after apply)
      - tags                              = {} -> null
      ~ url                               = "https://sqs.ca-central-1.amazonaws.com/687401027353/submission_processing.fifo" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_sqs_queue.reprocess_submission_queue must be replaced
-/+ resource "aws_sqs_queue" "reprocess_submission_queue" {
      ~ arn                               = "arn:aws:sqs:ca-central-1:687401027353:reprocess_submission_queue.fifo" -> (known after apply)
      ~ content_based_deduplication       = true -> false
      ~ deduplication_scope               = "queue" -> (known after apply)
      ~ fifo_queue                        = true -> false # forces replacement
      ~ fifo_throughput_limit             = "perQueue" -> (known after apply)
      ~ id                                = "https://sqs.ca-central-1.amazonaws.com/687401027353/reprocess_submission_queue.fifo" -> (known after apply)
      ~ name                              = "reprocess_submission_queue.fifo" -> "reliability_reprocessing_queue" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + redrive_allow_policy              = (known after apply)
      ~ redrive_policy                    = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:ca-central-1:687401027353:reliability_deadletter_queue.fifo"
              - maxReceiveCount     = 5
            }
        ) -> (known after apply)
      ~ sqs_managed_sse_enabled           = false -> (known after apply)
      - tags                              = {} -> null
      ~ url                               = "https://sqs.ca-central-1.amazonaws.com/687401027353/reprocess_submission_queue.fifo" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ sqs_reliability_dead_letter_queue_id   = "https://sqs.ca-central-1.amazonaws.com/687401027353/reliability_deadletter_queue.fifo" -> (known after apply)
  ~ sqs_reliability_deadletter_queue_arn   = "reliability_deadletter_queue.fifo" -> "reliability_deadletter_queue"
  ~ sqs_reliability_queue_arn              = "arn:aws:sqs:ca-central-1:687401027353:submission_processing.fifo" -> (known after apply)
  ~ sqs_reliability_queue_id               = "https://sqs.ca-central-1.amazonaws.com/687401027353/submission_processing.fifo" -> (known after apply)
  ~ sqs_reprocess_submission_queue_arn     = "arn:aws:sqs:ca-central-1:687401027353:reprocess_submission_queue.fifo" -> (known after apply)
  ~ sqs_reprocess_submission_queue_id      = "https://sqs.ca-central-1.amazonaws.com/687401027353/reprocess_submission_queue.fifo" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.api_audit_log_deadletter_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.api_audit_log_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.audit_log_deadletter_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.audit_log_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.reliability_deadletter_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.reliability_queue"]
WARN - plan.json - main - Missing Common Tags: ["aws_sqs_queue.reprocess_submission_queue"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
